var tests = [["География на 26.09.2024",["Что сделали новгородцы и поморы?","Чем была Мангазея?","Как называли Мангазею?","Что и когда сделал Ермак?","Что и когда сделал Иван Москвитин?","Что и когда сделал Василий Петров?","Что и когда сделали Дежнёв и Попов?","Что и когда сделал Ерофей Хабаров?","Что и когда сделал Владимир Атласов?","Что и когда сделал Иван Камчатый (Камчатой)"],["В 11 веке открыли Кельтский п-ов, Новую Землю, побережье Белого и Баренцева морей, организовали Мангазейский острог","Главным торговым центром Сибири","Златокипящий город","В 1579 году (или 1581, в разных источниках по разному) вышел к Иртышу и присоединил Сибирское ханство","В 1639 году открыл Сахалинский залив, основал поселения и порт Охотск","В 1644 году разведал путь из реки Лены в реку Зея и прошёл по Амуру","В 1648 году прошли проливом между Азией и Америкой","В 1650 году основал первые русские укрепления по берегам Амура","В 1697 году основал экспедицию на Камчатку, Курильские острова, первым из россиян достиг Тихого океана","В середине 17 века открыл Камчатку"]],["Биология - Ткани",["Функции покровной ткани","Местонахождение покровной ткани","Особенности покровной ткани","Функции мышечной ткани","Местонахождение мышечной ткани","Особенности мышечной ткани","Функции соединительной ткани","Местонахождение соединительной ткани","Особенности соединительной ткани","Функции нервной ткани","Местонахождение нервной ткани","Особенности нервной ткани","Нейрон - это","Аксон - это","Дендрит - это"],["Защита, обмен веществ, регенерация, секреторная","Кожные покровы, слизистые оболочки, сосуды, органы, железы","Мелкие клетки, постоянно делятся, хорошо регенерируют, находятся близко друг к другу, выделяют секрет","Сокращение","ЖКТ, кровеносные лимфотические сосуды, мочевыводящие пути, скелетные мышцы, стенки глотки и верхней части пищевода, язык, глазораздвигательные мышцы, миокард сердца","Ритмичное сокращение, развивает большую силу без больших затрат, состоит из нитевидных многоядерных кардиомиоцитов","Терморегуляция, защита, трофическая функция, опорная функция","Кровеносные лимфотические сосуды, кости, хрящи, связки и сухожилия, жировая ткань","Много межклеточного вещества, волокнистая структура, клетки расположены рыхло (подвижны)","Связь органов с окружающей средой,  взаимосвязь органов и их систем","Везде","Состоит из нейронов, дендритов, аксонов","Нервная клетка, структурная единица нервной системы","Отросток, передающий сигнал от тела нейрона к другим нейронам","Отросток, воспринимающий раздражение"]],["Музыка на 14.10.2024",["В каком веке появились первые записи народных песен?","Какой композитор является основоположником русской классической музыки (XIX век)?","Как называлось содружество композиторов в конце 50-х годов XIX века?","Назовите оперы М.П.Мусоргского","Какую оперу создал А.П. Бородин по произведению древнерусской литературы?","Какой композитор создал оперы: \"Псковитянка\" и \"Царская невеста\"?","Какое произведение о России написал С.В.Рахманинов?","Как называется симфония Д.Д.Шостаковича времен Великой Отечественной Войны?","Назовите национальную оперу М.И. Глинки","Как назывался гимн России М.И.Глинки с 1990 по 2000гг.?","Произведения Прокофьева","Когда и где было открыто первое в России высшее музыкальное учебное заведение (Русская пианистическая школа)","Кто стал инициатором создания Русской пианисической школы?","Кто был первым русским композитором, закончившим Русскую пианистическую школу?","Когда была создана Московская консерватория","Чьё имя сейчас носит Московская консерватория?","Перечислите три основные русские консерватории"],["В 18 веке","Михаил Иванович Глинка","Могучая кучка","Борис Годунов, Хованщина","Князь Игорь","Римский-Корсаков","Фортепианный концерт","Седьмая Ленинградская симфония","Иван Сусанин","Патриотическая песнь","Война и мир, Алексндр Невский","В Петербурге, 20 сентября 1862 года","Антон Рубинштейн","Пётр Ильич Чайковский","В 1866 году","Чайковского","Русская пианистическая школа, Московская консерватория, Российская академия имени Гнесиных"]],["Общество на 22.10.2024",["Начало становления","Основной фактор производства","Основной продукт производства","Характерные черты производства","Характер труда","Занятость населения","Основной вид экспорта","Социальная структура","Продолжительность жизни","Воздействие человека на природу","Взаимодействие с другими странами","Политическая жизнь"],["Неолитическая революция 10 - 3 тыс. до н.э.. Индустриальная революция 18 - 19 веков. Информационная революция конца 20 века.","Земля. Капитал. Знания","Пища. Промышленные изделия. Услуги","Ручной труд. Широкое применение механизмов и технологий. Автоматизация производства, компьютеризация общества","Индивидуальный труд. Преимущественно стандартная деятельность. Резкое повышение творческого начала в труде","Сельское хозяйство - около 75%. Сельское хозяйство - около 10%, промышленность - 85%. Сельское хозяйство - до 3%, промышленность - около 33%, услуги - около 66%","Сырьё. Продукты производства. Услуги","Сословия, классы, включённость всех в коллектив, замкнутость социальных структур, низкая социальная мобильность. Классовое деление, упрощение социальной структуры, подвижность и открытость социальных структур. Сокращение социальной дифференциации, рост численности среднего класса, профессиональная дифференциация в зависимости от уровня знаний, квалификации","40 - 50 лет. Свыше 70 лет. Свыше 70 лет","Локальное, неконтролируемое. Глобальное, неконтролируемое. Глобальное, контролируемое","Несущественное. Тесная взаимосвязь. Открытость общества","Преобладание монархических форм правления, политические свободы отсутствуют, власть выше закона (для неё не нужны обоснования), сочетание самоуправляющихся общин и традиционных империй. Провозглашение политических свобод, равенства перед законом, демократические преобразования, власть не воспринимается как данность, от неё требуется обоснование права на лидерство. Политический плюрализм, сильное гражданское общество, возникновение новой формы демократии - \"демократии консенсуса\""]],["История - Договоры",["1721 год - Ништадский мир между Россией и Швецией","1714 год - Утрехтский мир","Асьенто - это","1738 год - Венский договор между Австрией и Францией. В 1739 году присоединились Россия и Польша","Война Австрии и России против Турции","Аахенский мир","*название отсутствует*","1776 год - Декларация независимости США"],["1700 - 1721 (северная война). Россия получала Лифляндию, Эстляндию, Ингерманландию, часть Карелии, Моонзундские острова. Россия обязалась уплатить Швеции денежную компенсацию и возвратить Финляндию, занятую русскими войсками","1701 - 1714 (война за испанское наследство). Англия получила Гибралтар, остров Менорка и часть французских колоний в Америке. Также Англия приобрела Асьенто.","Исключительное право торговли африканскими рабами","1733 - 1738 (война за польское наследство). Станислав I Лещинский отказался от польского престола. Испания получила от Австрии Неаполь и Сицилию. Сардиния присоединила к себе западную часть Ломбардии.","1736 - 1739 год. Россия получила Азов, правобережную Украину, право на возведение крепости на Нижнем Дону. Кабарда приобрела независимость и стала буферной зоной между Россией и Турцией. В то же время Россия не имела права держать на Чёрном и Азовском морях военные корабли.","1740 - 1748 (война за австрийское наследство). Франция лишалась всех завоёванных территорий, взамен Великобритания вернула Франции крепость Луисбург в Северной Америке и остров Кап-Бретон. Австрия уступила Пруссии Селезию, Сардинскому королевству - часть Милонского герцогства, Испании - Парву, Пьяченцу, Густаулу. Испания продлила Великобритании право Асьенто.","1756 - 1763 (семилетняя война). Франция уступала Англии Канаду и другие земли Северной Америки. Пруссия заключила мир с Австрией и получила Селезию и графство Глац. Россия ничего не получила","1775 - 1783 (война за независимость США)"]],["Биология - Контрольная работа",["Ботаника - это","Зоология - это","Цитология - это","Физиология - это","Анатомия - это","Отличие вирусов","Отличие бактерий","Отличие растений","Отличие животных","Отличие грибов","Функции ядра","Функции плазматической мембраны","Функции цитоплазмы","Функции митохондрии","Функции лизосомы","Функции комплекса Гольджи","Функции гладкой эндоплазматической сети","Функции шероховатой эндоплазматической сети","Функции рибосом","Функции сократительной вакуоли","Функции пищеварительной вакуоли","Функции выделительной вакуоли","Функции микротрубочки","Местонахождение и функции покровной ткани","Местонахождение и функции мышечной ткани","Местонахождение и функции соединительной ткани","Местонахождение и функции нервной ткани","Какие изменения в строении скелета произошли у позвоночных животных в связи с освоением наземно-воздушной среды?","Опорно-двигательная система одноклеточных животных","Опорно-двигательная система радиолярий","Опорно-двигательная система кишечно-полостных","Опорно-двигательная система ланцетника","Опорно-двигательная система рыбы","Опорно-двигательная система земноводных","Опорно-двигательная система пресмыкающихся","Опорно-двигательная система птиц","Опорно-двигательная система млекопитающих","Питание кишечнополостных","Питание плоских червей","Питание круглых червей","Питание кольчатых червей","Питание паукообразных","Питание насекомых"],["Наука о растениях","Наука о животных","Наука о клетках","Наука о процессах жизнедеятельности","Наука о внутреннем строении оррганов и систем органов","Неклеточная форма","Отсутствует ядро","Умеют фотосинтезировать","Ограниченный рост, передвижение","Сочетают два царства (животные и растения): неограниченный рост, запасное вещество - гликоген","Хранение и передача наследственной информации. Регулирует процессы жизнедеятельности","Защита. Избирательное пропускание веществ. Рецепторная. Отделение содержания внутренних веществ клетки","Поддержание внутреннего состава. Транспорт веществ и структур клетки","Энергетическая станция клетки","Внутриклеточное пищеварение","Транспорт веществ. Создание лизосом. Синтез ферментов","Транспорт и создание углеводов и липидов","Синтез РНК и ДНК (белки - рибосомы), транспорт веществ","Синтез белков","Движение","Пищеварение","Удаление ненужных веществ","Формирование деления клетки","Кожные покровы, слизистые оболочки, сосуды, органы, железы в коже, слюнные железы, железы в кишечнике, железы внутренней секреции. Защита, обмен веществ, регенерация, секреторная","ЖКТ, кровеносные лимфотические сосуды, мочевыводящие пути, скелетные мышцы, стенки глотки и верхней части пищевода, язык, глазораздвигательные мышцы, миокард сердца. Сокращение","Кровеносные лимфотические сосуды, кости, хрящи, связки и сухожилия, жировая ткань. Терморегуляция, защита, трофическая, опорная","Везде. Связь органов с окрущающей средой, взаимосвязь органов и систем органов","Появление костного и хрящевого скелета, черепа, поясов конечностей, шейных позвонков, мышц","Реснички, жгутики, ложноножки","Одноклеточные животные с наружным скелетом из кремнезёма","Полость, заполненная жидкостью - мышечные стенки, оказывается давление на мышцы, что помогает поддерживать форму тела","Есть только хорда","Рёбра, оформленный скелет","Череп, позвоночник, конечности","Гибкая шея и подвижная голова","Быстрорастущий скелет, полые кости. Есть киль, небольшой череп","Всегда 7 шейных позвонков, подвижна поясничная область, позвоночник состоит из 5 отделов, скелеты парных конечностей позвоночных имеют сходное строение","Ротовое отверстие - кишечная полость - ротовое отверстие","Ротовое отверстие - глотка - разветвлённый кишечник - ротовое отверстие","Ротовое отверстие - глотка (передняя кишка) - средняя кишка - задняя кишка - анальное отверстие","Ротовое отверстие - передняя кишка (глотка и пищевод) - зоб - желудок - средняя кишка - задняя кишка - анальное отверстие","Двойное пищеварение. Рот - глотка - сосательный желудок - печень - средняя кишка - задняя кишка - анальное отверстие (клоака)","Ротовое отверстие - глотка - пищевод - зоб - мышечный желудок - средняя кишка - задняя кишка - анальное отверстие"]]];
window.onresize = function() {
	questionDiv.style.width = Math.floor(window.innerWidth * 0.5) + "px";
	questionDiv.style.height = Math.floor(window.innerHeight * 0.5) + "px";
	questionDiv.style.position = "absolute";
	showAnswer.style.width = Math.floor(window.innerWidth * 0.5) + "px";
	showAnswer.style.height = Math.floor(window.innerHeight * 0.5) + "px";
	showAnswer.style.left = Math.floor(window.innerWidth * 0.5) + "px";
	showAnswer.style.position = "absolute";
	yes.style.width = Math.floor(window.innerWidth * 0.5) + "px";
	yes.style.height = Math.floor(window.innerHeight * 0.45) + "px";
	yes.style.position = "absolute";
	yes.style.top = Math.floor(window.innerHeight * 0.5) + "px";
	no.style.width = Math.floor(window.innerWidth * 0.5) + "px";
	no.style.height = Math.floor(window.innerHeight * 0.45) + "px";
	no.style.position = "absolute";
	no.style.top = Math.floor(window.innerHeight * 0.5) + "px";
	no.style.left = Math.floor(window.innerWidth * 0.5) + "px";
	progress.style.width = Math.floor(window.innerWidth * 0.5) + "px";
	progress.style.height = Math.floor(window.innerWidth * 0.05) + "px";
	progress.style.position = "absolute";
	progress.style.top = Math.floor(window.innerHeight * 0.95) + "px";	
	final.style.width = Math.floor(window.innerWidth) + "px";
	final.style.height = Math.floor(window.innerHeight) + "px";
	final.style.position = "absolute";
}
window.onresize();
var currentTest = 0;
/*var restTest = [tests[currentTest], [], []];
for (var i = 0; i < tests[currentTest][1].length; i++) {
	restTest[1].push(tests[currentTest][1][i]);
	restTest[2].push(tests[currentTest][2][i]);
	console.log(tests[0][i]);
}*/
//var restTest = ["name1",["q11","q12","q13"],["a11","a12","a13"]];
var currentQuestion = 0;
var prevQuestion = -1; // чтобы избежать повторений
document.body.style.overflow = "visible";
var restTest = [];
var answeredOneAttempt = []; // ответил ли с первой попытки
var noPressed = 0;
for (var i = 0; i < tests.length; i++) {
	testsDiv.innerHTML += `<button class="ui" style="width: 250px; height: 100px; vertical-align: top;" onclick="currentTest = ${i};document.body.style.overflow = 'hidden';mainDiv.style.display = 'block';testsDiv.style.display = 'none';noPressed = 0;restTest = [tests[currentTest], [], []];for (var i = 0; i < tests[currentTest][1].length; i++) {	restTest[1].push(tests[currentTest][1][i]);	restTest[2].push(tests[currentTest][2][i]);	console.log(tests[currentTest][i]);}newQuestion();">${tests[i][0]}</button>`;
}
function newQuestion() {
	showAnswer.innerHTML = "Показать ответ";
	progress.style.width = Math.floor(window.innerWidth * (1 - restTest[1].length / tests[currentTest][1].length)) + "px";
	//console.log(restTest[1].length / tests[currentTest][1].length);
	if (restTest[1].length == 0) {
		document.body.style.overflow = 'visible';
		mainDiv.style.display = 'none';
		final.style.display = 'block';
		var answeredOneAttemptCount = 0;
		for (var i = 0; i < answeredOneAttempt.length; i++) {
			answeredOneAttempt[i] == true && answeredOneAttemptCount++;
		}
		final.innerHTML = "";
		if (answeredOneAttemptCount == tests[currentTest][1].length) {
			final.innerHTML = `Вы сёмга<br>`;
		}
		final.innerHTML += `Вы ответили с первой попытки на ${answeredOneAttemptCount}/${tests[currentTest][1].length} вопросов<br>Вы ошиблись ${noPressed} раз`;
	}
	if (prevQuestion == -1 || restTest[1].length == 1) {
		currentQuestion = Math.floor(Math.random() * restTest[1].length);
	} else {
		currentQuestion = Math.floor(Math.random() * (restTest[1].length - 1));
		if (currentQuestion >= prevQuestion) {
			currentQuestion++;
		}
	}
	prevQuestion = currentQuestion;
	questionDiv.innerHTML = restTest[1][currentQuestion];
	showAnswer.onclick = function() {
		if (showAnswer.innerHTML == restTest[2][currentQuestion]) {
			showAnswer.innerHTML = "Показать ответ";
		} else {
			showAnswer.innerHTML = restTest[2][currentQuestion];
		}
	}
}
no.onclick = function() {
	noPressed++;
	answeredOneAttempt[currentQuestion] = false;
	newQuestion();
}
yes.onclick = function() {
	if (answeredOneAttempt[tests[currentTest][1].indexOf(restTest[1][currentQuestion])] == undefined) {
		answeredOneAttempt[tests[currentTest][1].indexOf(restTest[1][currentQuestion])] = true;
	}
	//console.log(currentQuestion, );
	restTest[1].splice(currentQuestion, 1);
	restTest[2].splice(currentQuestion, 1);
	newQuestion();
}
final.onclick = function() {
	testsDiv.style.display = "block";
	final.style.display = 'none';
}
